# GlazingTransmittanceMap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Glazing..::..GlazingTransmittanceMap Property
Glazing Class See Also
---
The property labeled "Custom Color" from the "Glazing" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GlazingTransmittanceMap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GlazingTransmittanceMap As String
	Get
```

Visual C++
---
```text
public:
static property String^ GlazingTransmittanceMap {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
Glazing Class
Autodesk.Revit.DB.Visual Namespace